app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Bill"], ["last_name", "Smith"], ["created_at", "2017-04-11 19:39:17.883618"], ["updated_at", "2017-04-11 19:39:17.883618"]]
---
	def create
		@student = Student.new
		@student.first_name = params[:student][:first_name]
		@student.last_name = params[:student][:last_name]
		@student.save

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2017-04-11 19:50:55.067365"], ["id", 1]]
---
	def update
		@student = Student.find(params[:id])
		@student.update(params[:student])